x-labz/t-watch/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# Confirmed on hardware 2026-08-24: 16MB flash (Winbond ef/6018) via
# `esptool.py flash_id`, and 8MB PSRAM chip via boot log ("Found 8MB PSRAM
# device") — only 4MB gets mapped into address space, the classic-ESP32 cap
# from section 2, not a property of the chip itself.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# BLE scanner view. NimBLE rather than Bluedroid: this board only ever needs
# BLE (no classic BR/EDR), and NimBLE costs far less RAM/flash for that.
# BLE-only controller mode for the same reason. Note this makes the
# esp_bt_controller_mem_release() suggestion in section 9 inapplicable —
# the controller is now used, just kept off between scans.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
